<!-- add-pr-comment:dev-tfplan -->

Terraform plan output for dev

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.module.private_subnets.aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet"
          + "Project"      = "test-arc"
        }
      + tags_all   = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet"
          + "Project"      = "test-arc"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.module.private_subnets.aws_route.default["us-east-1a"] will be created
  + resource "aws_route" "default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.module.private_subnets.aws_route.default["us-east-1b"] will be created
  + resource "aws_route" "default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.module.private_subnets.aws_route_table.private["us-east-1a"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + tags_all         = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.private_subnets.aws_route_table.private["us-east-1b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + tags_all         = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.private_subnets.aws_route_table_association.private["us-east-1a"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.private_subnets.aws_route_table_association.private["us-east-1b"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.private_subnets.aws_subnet.private["us-east-1a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + tags_all                                       = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.private_subnets.aws_subnet.private["us-east-1b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + tags_all                                       = {
          + "Attributes"   = "private"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-private-subnet-private-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.public_subnets.aws_eip.public["us-east-1a"] will be created
  + resource "aws_eip" "public" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + tags_all             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + vpc                  = true
    }

  # module.network.module.public_subnets.aws_eip.public["us-east-1b"] will be created
  + resource "aws_eip" "public" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + tags_all             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + vpc                  = true
    }

  # module.network.module.public_subnets.aws_nat_gateway.public["us-east-1a"] will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
    }

  # module.network.module.public_subnets.aws_nat_gateway.public["us-east-1b"] will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
    }

  # module.network.module.public_subnets.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + tags_all   = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet"
          + "Project"      = "test-arc"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.module.public_subnets.aws_route.public["us-east-1a"] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.module.public_subnets.aws_route.public["us-east-1b"] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.module.public_subnets.aws_route_table.public["us-east-1a"] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all         = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.public_subnets.aws_route_table.public["us-east-1b"] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all         = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.public_subnets.aws_route_table_association.public["us-east-1a"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.public_subnets.aws_route_table_association.public["us-east-1b"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.public_subnets.aws_subnet.public["us-east-1a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all                                       = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1a"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.public_subnets.aws_subnet.public["us-east-1b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + tags_all                                       = {
          + "Attributes"   = "public"
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-public-subnet-public-us-east-1b"
          + "Project"      = "test-arc"
          + "Type"         = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc-default"
          + "Project"      = "test-arc"
        }
      + tags_all               = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc-default"
          + "Project"      = "test-arc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc"
          + "Project"      = "test-arc"
        }
      + tags_all = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc"
          + "Project"      = "test-arc"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc"
          + "Project"      = "test-arc"
        }
      + tags_all                             = {
          + "Environment"  = "dev"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/network"
          + "Name"         = "arc-dev-vpc"
          + "Project"      = "test-arc"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = {
      + us-east-1a = (known after apply)
      + us-east-1b = (known after apply)
    }
  + public_subnet_ids  = {
      + us-east-1a = (known after apply)
      + us-east-1b = (known after apply)
    }
  + vpc_id             = (known after apply)

```

